var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高二年段</span>\n\
    <span class="txtb">男子组  铅球  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	#	|	姓名	|	数据	| 排名 | 分数 |	班级	|\n\
|	-	|	-	|	- | - | -	|	-	|\n\
|	1	|	刘瑄铠	|	-	|	- | - | 高二9班	|\n\
|	2	|	梁翰宇	|	-	|	- | - | 高二9班	|\n\
|	3	|	明浩宇	|	-	|	- | - | 高二12班	|\n\
|	4	|	杨望	|	-	|	- | - | 高二8班	|\n\
|	5	|	林恒逸	|	-	|	- | - | 高二3班	|\n\
|	6	|	林哲昊	|	10.03	|	1 | 7 | 高二5班	|\n\
|	7	|	吴城安	|	-	|	- | - | 高二4班	|\n\
|	8	|	张博涵	|	-	|	- | - | 高二1班	|\n\
|	9	|	张仕杰	|	-	|	- | - | 高二11班	|\n\
|	10	|	卓海宁	|	9.00	|	3 | 4 | 高二9班	|\n\
|	11	|	余晨睿	|	-	|	- | - | 高二16班	|\n\
|	12	|	唐敬轩	|	-	|	- | - | 高二7班	|\n\
|	13	|	陈咏	|	-	|	- | - | 高二12班	|\n\
|	14	|	张楷杰	|	-	|	- | - | 高二10班	|\n\
|	15	|	黄镜伊	|	8.44	|	6 | 1 | 高二3班	|\n\
|	16	|	束云飞	|	8.62	|	4 | 3 | 高二10班	|\n\
|	17	|	张轩畅	|	-	|	- | - | 高二5班	|\n\
|	18	|	林坤键	|	-	|	- | - | 高二7班	|\n\
|	19	|	林青榆	|	-	|	- | - | 高二11班	|\n\
|	20	|	江龚羿	|	9.12	|	2 | 5 | 高二8班	|\n\
|	21	|	谢丰瑞	|	-	|	- | - | 高二2班	|\n\
|	22	|	黄鉴豪	|	-	|	- | - | 高二13班	|\n\
|	23	|	曾诚	|	-	|	- | - | 高二12班	|\n\
|	24	|	林航宇	|	8.57	|	5 | 2 | 高二7班	|\n\
|	25	|	林泓希	|	-	|	- | - | 高二8班	|\n\
|	26	|	江杰康	|	-	|	- | - | 高二11班	|\n\
|	27	|	张新杰	|	-	|	- | - | 高二6班	|\n\
|	28	|	张声扬	|	-	|	- | - | 高二6班	|\n\
|	29	|	俞嘉宸	|	-	|	- | - | 高二16班	|\n\
|	30	|	王伟灿	|	-	|	- | - | 高二5班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';