var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初一年段</span>\n\
    <span class="txtb">男子组  一分钟跳绳  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	#	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	李其鸿	|	-	|	初一9班	|\n\
|	2	|	林弘韬	|	-	|	初一1班	|\n\
|	3	|	卓扬轩	|	-	|	初一10班	|\n\
|	4	|	陈博涛	|	-	|	初一11班	|\n\
|	5	|	郑名伦	|	-	|	初一11班	|\n\
|	6	|	涂博凯	|	-	|	初一8班	|\n\
|	7	|	许子墨	|	-	|	初一14班	|\n\
|	8	|	陈子诚	|	-	|	初一9班	|\n\
|	9	|	郑轩辰	|	-	|	初一13班	|\n\
|	10	|	郑瑾烨	|	-	|	初一8班	|\n\
|	11	|	孙懿辰	|	-	|	初一3班	|\n\
|	12	|	李学智	|	-	|	初一6班	|\n\
|	13	|	姜葆睿	|	-	|	初一8班	|\n\
|	14	|	王思涵	|	-	|	初一9班	|\n\
|	15	|	陈泓亦	|	-	|	初一6班	|\n\
|	16	|	陈则睿	|	-	|	初一11班	|\n\
|	17	|	陈至一	|	-	|	初一13班	|\n\
|	18	|	邬陈和平	|	-	|	初一10班	|\n\
|	19	|	薛子涵	|	-	|	初一14班	|\n\
|	20	|	陈江灏	|	-	|	初一13班	|\n\
|	21	|	叶泽瑞	|	-	|	初一7班	|\n\
|	22	|	林炯哲	|	-	|	初一12班	|\n\
|	23	|	吴睿阳	|	-	|	初一7班	|\n\
|	24	|	肖涵羽	|	-	|	初一12班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';