var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高一年段</span>\n\
    <span class="txtb">男子组  三级跳远  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	#	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	吴烨豪	|	-	|	高一9班	|\n\
|	2	|	叶铭垚	|	-	|	高一13班	|\n\
|	3	|	吴翰凌	|	-	|	高一13班	|\n\
|	4	|	杨照	|	-	|	高一14班	|\n\
|	5	|	孙铭辰	|	-	|	高一10班	|\n\
|	6	|	林继宸	|	-	|	高一6班	|\n\
|	7	|	欧阳行远	|	-	|	高一8班	|\n\
|	8	|	陈伟豪	|	-	|	高一12班	|\n\
|	9	|	黄荣栋	|	-	|	高一3班	|\n\
|	10	|	江嘉森	|	-	|	高一10班	|\n\
|	11	|	邹晨浩	|	-	|	高一12班	|\n\
|	12	|	周镜尧	|	-	|	高一7班	|\n\
|	13	|	汪洛可	|	-	|	高一12班	|\n\
|	14	|	李博韬	|	-	|	高一6班	|\n\
|	15	|	刘宇轩	|	-	|	高一5班	|\n\
|	16	|	陈墨轩	|	-	|	高一7班	|\n\
|	17	|	王俊阳	|	-	|	高一7班	|\n\
|	18	|	陈俊昊	|	-	|	高一11班	|\n\
|	19	|	肖杨	|	-	|	高一2班	|\n\
|	20	|	彭宣然	|	-	|	高一4班	|\n\
|	21	|	郑哲恺	|	-	|	高一11班	|\n\
|	22	|	林意宸	|	-	|	高一6班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';