var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高一年段</span>\n\
    <span class="txtb">男子组  1000M  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	宋铭杰	|	-	|	高一9班	|\n\
|	2	|	沈靖城	|	-	|	高一13班	|\n\
|	3	|	林子辰	|	-	|	高一5班	|\n\
|	4	|	郑斯腾	|	-	|	高一4班	|\n\
|	5	|	朱林袆	|	-	|	高一12班	|\n\
|	6	|	陈诺霖	|	-	|	高一7班	|\n\
|	7	|	龚正轩	|	-	|	高一5班	|\n\
|	8	|	肖杨	|	-	|	高一2班	|\n\
|	9	|	顾柯	|	-	|	高一14班	|\n\
|	10	|	郑伊健	|	-	|	高一12班	|\n\
|	11	|	郑子睿	|	-	|	高一8班	|\n\
|	12	|	方宇辰	|	-	|	高一11班	|\n\
|	13	|	赵伦甲	|	-	|	高一6班	|\n\
|	14	|	郑浩桐	|	-	|	高一15班	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	孙铭辰	|	-	|	高一10班	|\n\
|	2	|	陈铭程	|	-	|	高一14班	|\n\
|	3	|	黄迪丞	|	-	|	高一2班	|\n\
|	4	|	黄君灏	|	-	|	高一7班	|\n\
|	5	|	郑皓文	|	-	|	高一4班	|\n\
|	6	|	李毅丞	|	-	|	高一12班	|\n\
|	7	|	吴昭帅	|	-	|	高一13班	|\n\
|	8	|	魏才智	|	-	|	高一5班	|\n\
|	9	|	郑哲恺	|	-	|	高一11班	|\n\
|	10	|	沈冠陈	|	-	|	高一3班	|\n\
|	11	|	陈彦昊	|	-	|	高一4班	|\n\
|	12	|	林继宸	|	-	|	高一6班	|\n\
|	13	|	肖政辉	|	-	|	高一11班	|\n\
|	14	|	倪炙轩	|	-	|	高一6班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';