var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高二年段</span>\n\
    <span class="txtb">男子组  1000M  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 | 分数 |	班级	|\n\
|	-	|	-	|	- | - | -	|	-	|\n\
|	1	|	林宋航	|	3:08.36	|	3 | 4 | 高二13班	|\n\
|	2	|	陈咏	|	-	|	- | - | 高二12班	|\n\
|	3	|	俞叙淙	|	-	|	- | - | 高二11班	|\n\
|	4	|	梁翰宇	|	-	|	- | - | 高二9班	|\n\
|	5	|	蔡亭宇	|	-	|	- | - | 高二10班	|\n\
|	6	|	周嘉毅	|	-	|	- | - | 高二5班	|\n\
|	7	|	丁跃翔	|	3:06.29	|	1 | 7 | 高二3班	|\n\
|	8	|	刘正枨	|	3:07.29	|	2 | 5 | 高二1班	|\n\
|	9	|	陈礼楷	|	-	|	- | - | 高二8班	|\n\
|	10	|	彭博政	|	-	|	- | - | 高二14班	|\n\
|	11	|	林翁涛	|	-	|	- | - | 高二2班	|\n\
|	12	|	傅博文	|	-	|	- | - | 高二11班	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 | 分数 |	班级	|\n\
|	-	|	-	|	- | - | -	|	-	|\n\
|	1	|	王伟灿	|	-	|	- | - | 高二5班	|\n\
|	2	|	高圣东	|	-	|	- | - | 高二13班	|\n\
|	3	|	田昊锦	|	-	|	- | - | 高二12班	|\n\
|	4	|	郭知涵	|	-	|	- | - | 高二11班	|\n\
|	5	|	林羿鸣	|	3:14.05	|	5 | 2 | 高二7班	|\n\
|	6	|	王鼎丞	|	-	|	- | - | 高二10班	|\n\
|	7	|	高子翔	|	3:18.14	|	6 | 1 | 高二8班	|\n\
|	8	|	李集翔	|	-	|	- | - | 高二3班	|\n\
|	9	|	钟毅铭	|	-	|	- | - | 高二4班	|\n\
|	10	|	卢锐羽	|	-	|	- | - | 高二8班	|\n\
|	11	|	胡致昊	|	3:08.99	|	4 | 3 | 高二6班	|\n\
|	12	|	余潘超	|	-	|	- | - | 高二9班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';