var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高三年段</span>\n\
    <span class="txtb">男子组  1000M  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	郑宏涛	|	-	|	高三4班	|\n\
|	2	|	李柯	|	-	|	高三11班	|\n\
|	3	|	杨博渊	|	-	|	高三6班	|\n\
|	4	|	游英杰	|	-	|	高三10班	|\n\
|	5	|	张浩	|	-	|	高三2班	|\n\
|	6	|	陈永鸿	|	-	|	高三9班	|\n\
|	7	|	林世祖	|	-	|	高三13班	|\n\
|	8	|	林福祥	|	-	|	高三13班	|\n\
|	9	|	白君逸	|	-	|	高三1班	|\n\
|	10	|	江绍民	|	-	|	高三3班	|\n\
|	11	|	吴宇涵	|	-	|	高三10班	|\n\
|	12	|	袁野	|	-	|	高三7班	|\n\
|	13	|	范恩泽	|	-	|	高三5班	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	汪晰	|	-	|	高三6班	|\n\
|	2	|	夏佳乐	|	-	|	高三4班	|\n\
|	3	|	胡曦文	|	-	|	高三11班	|\n\
|	4	|	王子凡	|	-	|	高三6班	|\n\
|	5	|	谢万林	|	-	|	高三4班	|\n\
|	6	|	徐昌俊	|	-	|	高三2班	|\n\
|	7	|	李想	|	-	|	高三8班	|\n\
|	8	|	赵铮鸣	|	-	|	高三13班	|\n\
|	9	|	林新民	|	-	|	高三9班	|\n\
|	10	|	林鹏	|	-	|	高三1班	|\n\
|	11	|	张志鹏	|	-	|	高三1班	|\n\
|	12	|	郑泓浩	|	-	|	高三10班	|\n\
|	13	|	郑志宇	|	-	|	高三7班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';