var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初一年段</span>\n\
    <span class="txtb">男子组  50M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |	班级	|\n\
|	-	|	-	|	- | -	|	-	|\n\
|	1	|	余思庆	|	-	|	- | 初一4班	|\n\
|	2	|	陈乐天	|	-	|	- | 初一5班	|\n\
|	3	|	林辰浩	|	-	|	- | 初一14班	|\n\
|	4	|	彭欣乐	|	7.37	|	7 | 初一12班	|\n\
|	5	|	郑轩辰	|	-	|	- | 初一13班	|\n\
|	6	|	林达熠	|	-	|	- | 初一3班	|\n\
|	7	|	黄馨睿	|	-	|	- | 初一1班	|\n\
|	8	|	-	|	- | -	|	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |	班级	|\n\
|	-	|	-	|	- | -	|	-	|\n\
|	1	|	张宁远	|	-	|	- | 初一11班	|\n\
|	2	|	王弘熠	|	-	|	- | 初一7班	|\n\
|	3	|	陈兆翰	|	-	|	- | 初一5班	|\n\
|	4	|	黄浩宇	|	7.42	|	8 | 初一14班	|\n\
|	5	|	林奕轩	|	7.33	|	6 | 初一12班	|\n\
|	6	|	章君浩	|	-	|	- | 初一13班	|\n\
|	7	|	陈予晨	|	-	|	- | 初一6班	|\n\
|	8	|	-	|	- | -	|	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |	班级	|\n\
|	-	|	-	|	- | -	|	-	|\n\
|	1	|	吴默嵘	|	-	|	- | 初一8班	|\n\
|	2	|	陈蔚	|	-	|	- | 初一11班	|\n\
|	3	|	张恩涤	|	7.21	|	3 | 初一7班	|\n\
|	4	|	吴禹宸	|	-	|	- | 初一5班	|\n\
|	5	|	卓扬轩	|	-	|	- | 初一10班	|\n\
|	6	|	曾皓祥	|	-	|	- | 初一2班	|\n\
|	7	|	汪乐钦	|	-	|	- | 初一13班	|\n\
|	8	|	-	|	- | -	|	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |	班级	|\n\
|	-	|	-	|	- | -	|	-	|\n\
|	1	|	-	|	- | -	|	-	|\n\
|	2	|	杨于瞳	|	7.27	|	5 | 初一8班	|\n\
|	3	|	卓思承	|	7.22	|	4 | 初一11班	|\n\
|	4	|	李其鸿	|	-	|	- | 初一9班	|\n\
|	5	|	蔡宗轩	|	7.20	|	2 | 初一12班	|\n\
|	6	|	魏楚杰	|	-	|	- | 初一4班	|\n\
|	7	|	陈阳睿	|	6.98	|	1 | 初一2班	|\n\
|	8	|	-	|	- | -	|	-	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';