var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初二年段</span>\n\
    <span class="txtb">男子组  50M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	陈基州	|	-	|	初二3班	|\n\
|	2	|	戴志炜	|	-	|	初二9班	|\n\
|	3	|	汤瀚舒	|	-	|	初二5班	|\n\
|	4	|	官睿晨	|	-	|	初二8班	|\n\
|	5	|	王佳睿	|	-	|	初二2班	|\n\
|	6	|	林宗翰	|	-	|	初二11班	|\n\
|	7	|	郭文天	|	-	|	初二1班	|\n\
|	8	|	-	|	-	|	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	刘峻熙	|	-	|	初二1班	|\n\
|	2	|	陈子烁	|	-	|	初二10班	|\n\
|	3	|	陈雨泽	|	-	|	初二9班	|\n\
|	4	|	余熙童	|	-	|	初二5班	|\n\
|	5	|	张浚榕	|	-	|	初二7班	|\n\
|	6	|	陈源	|	-	|	初二4班	|\n\
|	7	|	刘亦翔	|	-	|	初二11班	|\n\
|	8	|	-	|	-	|	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	王新睿	|	-	|	初二12班	|\n\
|	2	|	肖楠	|	-	|	初二5班	|\n\
|	3	|	吴思远	|	-	|	初二10班	|\n\
|	4	|	李思言	|	-	|	初二9班	|\n\
|	5	|	陈鸿杰	|	-	|	初二6班	|\n\
|	6	|	桂浩然	|	-	|	初二7班	|\n\
|	7	|	林伟杰	|	-	|	初二4班	|\n\
|	8	|	-	|	-	|	-	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';