var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初三年段</span>\n\
    <span class="txtb">男子组  50M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	卓林浩	|	-	|	初三2班	|\n\
|	2	|	倪梓康	|	-	|	初三1班	|\n\
|	3	|	陈明森	|	-	|	初三5班	|\n\
|	4	|	张钱枨	|	-	|	初三10班	|\n\
|	5	|	林奕聪	|	-	|	初三4班	|\n\
|	6	|	林宇轩	|	-	|	初三12班	|\n\
|	7	|	陈瀚洋	|	-	|	初三3班	|\n\
|	8	|	邓名竣	|	-	|	初三6班	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	林宸	|	-	|	初三6班	|\n\
|	2	|	陈顺杰	|	-	|	初三8班	|\n\
|	3	|	黄杨潇	|	-	|	初三1班	|\n\
|	4	|	郑宇辰	|	-	|	初三11班	|\n\
|	5	|	王奕程	|	-	|	初三7班	|\n\
|	6	|	马言旭	|	-	|	初三4班	|\n\
|	7	|	林宇轩	|	-	|	初三12班	|\n\
|	8	|	吴思翰	|	-	|	初三3班	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	傅嘉俊	|	-	|	初三3班	|\n\
|	2	|	陈宇恒	|	-	|	初三6班	|\n\
|	3	|	林哲祺	|	-	|	初三8班	|\n\
|	4	|	唐正	|	-	|	初三1班	|\n\
|	5	|	蒋仕铉	|	-	|	初三11班	|\n\
|	6	|	黄羿灿	|	-	|	初三9班	|\n\
|	7	|	林木淞	|	-	|	初三5班	|\n\
|	8	|	-	|	-	|	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	林铠尧	|	-	|	初三12班	|\n\
|	2	|	陈柏宏	|	-	|	初三10班	|\n\
|	3	|	陈致涵	|	-	|	初三2班	|\n\
|	4	|	陈铭皓	|	-	|	初三8班	|\n\
|	5	|	张行健	|	-	|	初三4班	|\n\
|	6	|	刘恒屹	|	-	|	初三11班	|\n\
|	7	|	杨子毅	|	-	|	初三9班	|\n\
|	8	|	-	|	-	|	-	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';