var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初二年段</span>\n\
    <span class="txtb">男子组  立定跳远  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	#	|	姓名	|	数据	| 排名 | 分数 |	班级	|\n\
|	-	|	-	|	- | - | -	|	-	|\n\
|	1	|	李梓源	|	-	|	- | - | 初二3班	|\n\
|	2	|	李博涵	|	-	|	- | - | 初二10班	|\n\
|	3	|	陈彦康	|	-	|	- | - | 初二4班	|\n\
|	4	|	方俊一	|	-	|	- | - | 初二6班	|\n\
|	5	|	黄可一	|	-	|	- | - | 初二6班	|\n\
|	6	|	严锦跃	|	-	|	- | - | 初二5班	|\n\
|	7	|	黄校涵	|	-	|	- | - | 初二2班	|\n\
|	8	|	肖毅涵	|	-	|	- | - | 初二5班	|\n\
|	9	|	林元瀚	|	2.44	|	5 | 2 | 初二5班	|\n\
|	10	|	林家锐	|	-	|	- | - | 初二7班	|\n\
|	11	|	朱栩烨	|	2.63	|	1 | 7 | 初二11班	|\n\
|	12	|	张鑫煜	|	-	|	- | - | 初二8班	|\n\
|	13	|	林俊杰	|	-	|	- | - | 初二1班	|\n\
|	14	|	朱杰	|	-	|	- | - | 初二10班	|\n\
|	15	|	卞嘉锐	|	2.48	|	4 | 3 | 初二2班	|\n\
|	16	|	林钰澄	|	-	|	- | - | 初二1班	|\n\
|	17	|	洪铭辰	|	2.43	|	6 | 1 | 初二3班	|\n\
|	18	|	陈雨泽	|	-	|	- | - | 初二9班	|\n\
|	19	|	陈茂荣	|	-	|	- | - | 初二7班	|\n\
|	20	|	李洋	|	2.56	|	2 | 5 | 初二12班	|\n\
|	21	|	陈铭杰	|	-	|	- | - | 初二12班	|\n\
|	22	|	李昂	|	-	|	- | - | 初二4班	|\n\
|	23	|	王以诺	|	2.55	|	3 | 4 | 初二9班	|\n\
|	24	|	陈思睿	|	-	|	- | - | 初二7班	|\n\
|	25	|	陈灏楠	|	-	|	- | - | 初二9班	|\n\
|	26	|	张皓轩	|	-	|	- | - | 初二11班	|\n\
|	27	|	王鸿力	|	-	|	- | - | 初二8班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';