var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高一年段</span>\n\
    <span class="txtb">男子组  铅球  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	#	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	汪洛可	|	-	|	高一12班	|\n\
|	2	|	陈鑫	|	-	|	高一6班	|\n\
|	3	|	洪浩铧	|	-	|	高一4班	|\n\
|	4	|	许楷翔	|	-	|	高一15班	|\n\
|	5	|	吴昭帅	|	-	|	高一13班	|\n\
|	6	|	杨宸烨	|	-	|	高一2班	|\n\
|	7	|	李隆琨	|	-	|	高一14班	|\n\
|	8	|	刘嘉杰	|	-	|	高一12班	|\n\
|	9	|	王子睿	|	-	|	高一15班	|\n\
|	10	|	吴起弦	|	-	|	高一3班	|\n\
|	11	|	许恩哲	|	-	|	高一1班	|\n\
|	12	|	刘秉坤	|	-	|	高一9班	|\n\
|	13	|	尤良涛	|	-	|	高一5班	|\n\
|	14	|	陈墨林	|	-	|	高一11班	|\n\
|	15	|	黄迪丞	|	-	|	高一2班	|\n\
|	16	|	张子渊	|	-	|	高一15班	|\n\
|	17	|	李浩轩	|	-	|	高一3班	|\n\
|	18	|	周镜尧	|	-	|	高一7班	|\n\
|	19	|	郑伊健	|	-	|	高一12班	|\n\
|	20	|	李鹏涛	|	-	|	高一6班	|\n\
|	21	|	张毅涛	|	-	|	高一9班	|\n\
|	22	|	廖梓晗	|	-	|	高一8班	|\n\
|	23	|	吴书怀	|	-	|	高一8班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';