var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高二年段</span>\n\
    <span class="txtb">男子组  100M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |  班级	|\n\
|	-	|	-	|	-	|	-	|	-	|\n\
|	1	|	黄家铭	|	-	|	-	|	高二11班	|\n\
|	2	|	张海韵	|	12.61	|	6 | 高二12班	|\n\
|	3	|	赵禾阳	|	-	|	-	|	高二14班	|\n\
|	4	|	吴张恒	|	-	|	-	|	高二6班	|\n\
|	5	|	王垚彬	|	**11.48**	|	1 |  高二7班	|\n\
|	6	|	卢锐羽	|	-	|	-	|	高二8班	|\n\
|	7	|	余晨睿	|	-	|	-	|	高二16班	|\n\
|	8	|	-	|	-   |   -   |   -   |\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |  班级	|\n\
|	-	|	-	|	-	|	-	|	-	|\n\
|	1	|	王楚彬	|	-	|	-	|	高二1班	|\n\
|	2	|	林涛	|	-	|	-	|	高二5班	|\n\
|	3	|	范思贤	|	-	|	-	|	高二2班	|\n\
|	4	|	孙为权	|	-	|	-	|	高二15班	|\n\
|	5	|	谢启楠	|	-	|	-	|	高二6班	|\n\
|	6	|	王鼎丞	|	-	|	-	|	高二10班	|\n\
|	7	|	陈叶鹏	|	-	|	-	|	高二8班	|\n\
|	8	|	-	|	-   |   -   |   -   |\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |  班级	|\n\
|	-	|	-	|	-	|	-	|	-	|\n\
|	1	|	柯南	|	11.94	|	3 | 高二16班	|\n\
|	2	|	陈致宏	|	12.71	|	7 | 高二4班	|\n\
|	3	|	黄宇轩	|	-	|	-	|	高二5班	|\n\
|	4	|	陈冠泽	|	12.56	|	5 | 高二9班	|\n\
|	5	|	倪正行	|	-	|	-	|	高二15班	|\n\
|	6	|	廖铭轩	|	-	|	-	|	高二3班	|\n\
|	7	|	蔡亭宇	|	-	|	-	|	高二10班	|\n\
|	8	|	-	|	-   |   -   |   -   |\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |  班级	|\n\
|	-	|	-	|	-	|	-	|	-	|\n\
|	1	|	-	|	-	|	- | -	|\n\
|	2	|	陈铭绅	|	-	|	-	|	高二16班	|\n\
|	3	|	许翔	|	11.91	|	2 | 高二4班	|\n\
|	4	|	杨加曜	|	-	|	-	|	高二5班	|\n\
|	5	|	陈杰	|	12.04	|	4 | 高二9班	|\n\
|	6	|	卓睿喆	|	-	|	-	|	高二15班	|\n\
|	7	|	林仕诚	|	12.81	|	8 | 高二12班	|\n\
|	8	|	-	|	-   |   -   |   -   |\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';