var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高二年段</span>\n\
    <span class="txtb">女子组  100M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |	班级	|\n\
|	-	|	-	|	- | -	|	-	|\n\
|	1	|	-	|	- | -	|	-	|\n\
|	2	|	刘子瑄	|	15.35	|	4 | 高二9班	|\n\
|	3	|	卢思羽	|	-	|	- | 高二5班	|\n\
|	4	|	林佳梦	|	15.58	|	6 | 高二4班	|\n\
|	5	|	蓝越	|	-	|	- | 高二15班	|\n\
|	6	|	郑佳怡	|	14.57	|	1 | 高二14班	|\n\
|	7	|	巢心绚	|	-	|	- | 高二13班	|\n\
|	8	|	-	|	- | -	|	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |	班级	|\n\
|	-	|	-	|	- | -	|	-	|\n\
|	1	|	-	|	- | -	|	-	|\n\
|	2	|	林南希	|	-	|	- | 高二16班	|\n\
|	3	|	詹雨涵	|	-	|	- | 高二9班	|\n\
|	4	|	何鸣倩	|	-	|	- | 高二8班	|\n\
|	5	|	甘湘榕	|	15.90	|	7 | 高二4班	|\n\
|	6	|	谢思睿	|	15.40	|	5 | 高二6班	|\n\
|	7	|	林晓晗	|	-	|	- | 高二14班	|\n\
|	8	|	-	|	- | -	|	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |	班级	|\n\
|	-	|	-	|	- | -	|	-	|\n\
|	1	|	-	|	- | -	|	-	|\n\
|	2	|	戴月宸	|	15.30	|	3 | 高二15班	|\n\
|	3	|	蔡锦雯	|	-	|	- | 高二16班	|\n\
|	4	|	张思琪	|	15.18	|	2 | 高二7班	|\n\
|	5	|	李兆阳	|	16.08	|	8 | 高二13班	|\n\
|	6	|	李钟焓	|	-	|	- | 高二14班	|\n\
|	7	|	-	|	- | -	|	-	|\n\
|	8	|	-	|	- | -	|	-	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';