var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高三年段</span>\n\
    <span class="txtb">男子组  100M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 | 班级	|\n\
|	-	|	-	|	-	|	-	|	-	|\n\
|	1	|	黄泺宁	|	**11.29**	|	1 | 高三5班	|\n\
|	2	|	程赛熙	|	-	|	- | 高三12班	|\n\
|	3	|	张志鹏	|	-	|	- |  高三1班	|\n\
|	4	|	范书颜	|	-	|	- |  高三10班	|\n\
|	5	|	张东檀	|	-	|	- |  高三9班	|\n\
|	6	|	蔡斯涵	|	-	|	- |  高三15班	|\n\
|	7	|	高书浩	|	-	|	- |  高三11班	|\n\
|	8	|	-	|	-   |   -   |   -   |	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |  班级	|\n\
|	-	|	-	|	-	|	-	|	-	|\n\
|	1	|	林锐杰	|	-	|	- |  高三11班	|\n\
|	2	|	蔡建煊	|	-	|	- |  高三6班	|\n\
|	3	|	吴昌汲	|	-	|	- |  高三12班	|\n\
|	4	|	吴雨轩	|	-	|	- | 高三13班	|\n\
|	5	|	胡裕权	|	-	|	- |   高三4班	|\n\
|	6	|	陈誉仁	|	-	|	- |   高三9班	|\n\
|	7	|	黄瀚茗	|	11.96	|	3 |  高三2班	|\n\
|	8	|	-	|	-   |   -   |   -   |	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |  班级	|\n\
|	-	|	-	|	-	|	-	|	-	|\n\
|	1	|	-	|	- | - | -	|	-	|\n\
|	2	|	王俊涛	|	11.85	|	2 | - | 高三5班	|\n\
|	3	|	游程曦	|	-	|	- | - | 高三6班	|\n\
|	4	|	冯耀元	|	-	|	- | - | 高三1班	|\n\
|	5	|	赵铮鸣	|	-	|	- | - | 高三13班	|\n\
|	6	|	肖晨烨	|	-	|	- | - | 高三4班	|\n\
|	7	|	张涵俊	|	-	|	- | - | 高三14班	|\n\
|	8	|	-	|	-   |   -   |   -   |	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	| 排名 |  班级	|\n\
|	-	|	-	|	-	|	-	|	-	|\n\
|	1	|	-	|	- | -	|	-	|\n\
|	2	|	吕宇豪	|	-	|	- |  高三10班	|\n\
|	3	|	兰孝浚	|	12.09	|	4 |  高三5班	|\n\
|	4	|	翁嘉宝	|	12.44	|	5 |  高三6班	|\n\
|	5	|	刘希宇	|	-	|	- |   高三1班	|\n\
|	6	|	林忠袁	|	-	|	- |   高三9班	|\n\
|	7	|	游陈畅	|	12.73	|	6 |   高三3班	|\n\
|	8	|	-	|	-   |   -   |   -   |	-	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';