var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高三年段</span>\n\
    <span class="txtb">女子组  100M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	班级	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	钟雅雯	|	-	|	高三14班	|\n\
|	2	|	董秋君	|	-	|	高三2班	|\n\
|	3	|	黄子晗	|	-	|	高三5班	|\n\
|	4	|	李靖颖	|	-	|	高三13班	|\n\
|	5	|	郑宇晴	|	-	|	高三3班	|\n\
|	6	|	施蕴琦	|	-	|	高三15班	|\n\
|	7	|	林嘉欣	|	-	|	高三1班	|\n\
|	8	|	-	|	-	|	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	班级	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	罗楚涵	|	-	|	高三7班	|\n\
|	2	|	游佳慧	|	-	|	高三14班	|\n\
|	3	|	陈可歆	|	-	|	高三2班	|\n\
|	4	|	朱莹嘉	|	-	|	高三6班	|\n\
|	5	|	陈玟洁	|	-	|	高三13班	|\n\
|	6	|	白如漪	|	-	|	高三12班	|\n\
|	7	|	袁楚涵	|	-	|	高三15班	|\n\
|	8	|	-	|	-	|	-	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	班级	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	-	|	-	|	-	|\n\
|	2	|	卢函知	|	-	|	高三13班	|\n\
|	3	|	徐瑜苹	|	-	|	高三8班	|\n\
|	4	|	余宸亦	|	-	|	高三4班	|\n\
|	5	|	官灵	|	-	|	高三6班	|\n\
|	6	|	曹羽涵	|	-	|	高三9班	|\n\
|	7	|	张瑾璘	|	-	|	高三12班	|\n\
|	8	|	-	|	-	|	-	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';