var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初二年段</span>\n\
    <span class="txtb">男子组  200M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	班级	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	林榆翔	|	-	|	初二4班	|\n\
|	2	|	肖楠	|	-	|	初二5班	|\n\
|	3	|	姚月凯	|	-	|	初二8班	|\n\
|	4	|	陈铭杰	|	-	|	初二12班	|\n\
|	5	|	李梓源	|	-	|	初二3班	|\n\
|	6	|	李思言	|	-	|	初二9班	|\n\
|	7	|	黄校涵	|	-	|	初二2班	|\n\
|	8	|	杨文逍	|	-	|	初二10班	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	班级	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	方远骏	|	-	|	初二11班	|\n\
|	2	|	林煜宸	|	-	|	初二1班	|\n\
|	3	|	汤瀚舒	|	-	|	初二5班	|\n\
|	4	|	翁晨阳	|	-	|	初二7班	|\n\
|	5	|	丁浩昇	|	-	|	初二12班	|\n\
|	6	|	陈子烁	|	-	|	初二10班	|\n\
|	7	|	王以诺	|	-	|	初二9班	|\n\
|	8	|	江尚坤	|	-	|	初二2班	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	班级	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	张羽铮	|	-	|	初二4班	|\n\
|	2	|	朱栩烨	|	-	|	初二11班	|\n\
|	3	|	王轶源	|	-	|	初二5班	|\n\
|	4	|	陈宇轩	|	-	|	初二6班	|\n\
|	5	|	郑嘉俊	|	-	|	初二7班	|\n\
|	6	|	王喆赫	|	-	|	初二12班	|\n\
|	7	|	周煜昊	|	-	|	初二10班	|\n\
|	8	|	黄子峻	|	-	|	初二9班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';