var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初一年段</span>\n\
    <span class="txtb">男子组  1000M  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	邹遵漪	|	-	|	初一2班	|\n\
|	2	|	林圣涛	|	-	|	初一3班	|\n\
|	3	|	杨于瞳	|	-	|	初一8班	|\n\
|	4	|	章君浩	|	-	|	初一13班	|\n\
|	5	|	徐子木	|	-	|	初一5班	|\n\
|	6	|	郑瑾烨	|	-	|	初一8班	|\n\
|	7	|	许子墨	|	-	|	初一14班	|\n\
|	8	|	刘昌民	|	-	|	初一9班	|\n\
|	9	|	陈逸伦	|	-	|	初一6班	|\n\
|	10	|	林浩翔	|	-	|	初一1班	|\n\
|	11	|	黄正轩	|	-	|	初一4班	|\n\
|	12	|	邬陈和平	|	-	|	初一10班	|\n\
|	13	|	陈乐天	|	-	|	初一5班	|\n\
|	14	|	许家棋	|	-	|	初一12班	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	张文滔	|	-	|	初一2班	|\n\
|	2	|	林铂尧	|	-	|	初一14班	|\n\
|	3	|	陈亮羽	|	-	|	初一3班	|\n\
|	4	|	李泰允	|	-	|	初一1班	|\n\
|	5	|	陈江灏	|	-	|	初一13班	|\n\
|	6	|	杨宇轩	|	-	|	初一12班	|\n\
|	7	|	姜葆睿	|	-	|	初一8班	|\n\
|	8	|	何浩喆	|	-	|	初一10班	|\n\
|	9	|	陈奕宏	|	-	|	初一9班	|\n\
|	10	|	翁浩洋	|	-	|	初一6班	|\n\
|	11	|	王淳烨	|	-	|	初一11班	|\n\
|	12	|	卓煜淞	|	-	|	初一4班	|\n\
|	13	|	林煜博	|	-	|	初一4班	|\n\
|	14	|	方泓轲	|	-	|	初一5班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';