var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初二年段</span>\n\
    <span class="txtb">男子组  1000M  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	卞嘉锐	|	-	|	初二2班	|\n\
|	2	|	潘秭桦	|	-	|	初二11班	|\n\
|	3	|	方俊一	|	-	|	初二6班	|\n\
|	4	|	许中寅	|	-	|	初二1班	|\n\
|	5	|	林奕程	|	-	|	初二3班	|\n\
|	6	|	陈鹏涛	|	-	|	初二7班	|\n\
|	7	|	丁浩昇	|	-	|	初二12班	|\n\
|	8	|	李博涵	|	-	|	初二10班	|\n\
|	9	|	黄天健	|	-	|	初二8班	|\n\
|	10	|	王轶源	|	-	|	初二5班	|\n\
|	11	|	张浚榕	|	-	|	初二7班	|\n\
|	12	|	李昀宸	|	-	|	初二9班	|\n\
|	13	|	吴鸣泓	|	-	|	初二12班	|\n\
|	14	|	林榆翔	|	-	|	初二4班	|\n\
|	15	|	李旻栩	|	-	|	初二3班	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	吴思远	|	-	|	初二10班	|\n\
|	2	|	林伟杰	|	-	|	初二4班	|\n\
|	3	|	张皓轩	|	-	|	初二11班	|\n\
|	4	|	林泽尧	|	-	|	初二6班	|\n\
|	5	|	高继瀚	|	-	|	初二5班	|\n\
|	6	|	洪铭辰	|	-	|	初二3班	|\n\
|	7	|	王佳睿	|	-	|	初二2班	|\n\
|	8	|	侯宗好	|	-	|	初二12班	|\n\
|	9	|	林睿阳	|	-	|	初二10班	|\n\
|	10	|	王鸿力	|	-	|	初二8班	|\n\
|	11	|	林嘉逸	|	-	|	初二6班	|\n\
|	12	|	郑嘉俊	|	-	|	初二7班	|\n\
|	13	|	陈灏楠	|	-	|	初二9班	|\n\
|	14	|	戴志炜	|	-	|	初二9班	|\n\
|	15	|	丁璨霖	|	-	|	初二1班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';