var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高一年段</span>\n\
    <span class="txtb">男子组  跳远  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	#	|	姓名	|	数据	|	班级	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	黄荣栋	|	-	|	高一3班	|\n\
|	2	|	陈墨轩	|	-	|	高一7班	|\n\
|	3	|	彭宣然	|	-	|	高一4班	|\n\
|	4	|	杨照	|	-	|	高一14班	|\n\
|	5	|	黄宏彬	|	-	|	高一1班	|\n\
|	6	|	魏才智	|	-	|	高一5班	|\n\
|	7	|	陈鑫	|	-	|	高一6班	|\n\
|	8	|	林子焜	|	-	|	高一14班	|\n\
|	9	|	邹晨浩	|	-	|	高一12班	|\n\
|	10	|	林其楷	|	-	|	高一10班	|\n\
|	11	|	郑宇轩	|	-	|	高一2班	|\n\
|	12	|	沈靖城	|	-	|	高一13班	|\n\
|	13	|	杨展滔	|	-	|	高一13班	|\n\
|	14	|	陈俊昊	|	-	|	高一11班	|\n\
|	15	|	詹奕钊	|	-	|	高一6班	|\n\
|	16	|	陈伟豪	|	-	|	高一12班	|\n\
|	17	|	郑浩桐	|	-	|	高一15班	|\n\
|	18	|	朱奕军	|	-	|	高一9班	|\n\
|	19	|	阮信雄	|	-	|	高一1班	|\n\
|	20	|	洪彦彬	|	-	|	高一10班	|\n\
|	21	|	林意宸	|	-	|	高一6班	|\n\
|	22	|	李毅丞	|	-	|	高一12班	|\n\
|	23	|	王俊阳	|	-	|	高一7班	|\n\
|	24	|	吴翰凌	|	-	|	高一13班	|\n\
|	25	|	柯博文	|	-	|	高一2班	|\n\
|	26	|	欧阳行远	|	-	|	高一8班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';