var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初二年段</span>\n\
    <span class="txtb">男子组  一分钟跳绳  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	#	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	李旻栩	|	-	|	初二3班	|\n\
|	2	|	陈思睿	|	-	|	初二7班	|\n\
|	3	|	方远骏	|	-	|	初二11班	|\n\
|	4	|	林俊杰	|	-	|	初二1班	|\n\
|	5	|	李昀宸	|	-	|	初二9班	|\n\
|	6	|	李洋	|	-	|	初二12班	|\n\
|	7	|	陈鹏涛	|	-	|	初二7班	|\n\
|	8	|	刘章銮	|	-	|	初二2班	|\n\
|	9	|	陈宇轩	|	-	|	初二6班	|\n\
|	10	|	郭文天	|	-	|	初二1班	|\n\
|	11	|	张峻赫	|	-	|	初二3班	|\n\
|	12	|	黄正弘	|	-	|	初二4班	|\n\
|	13	|	王虞闽	|	-	|	初二9班	|\n\
|	14	|	陈奕宏	|	-	|	初二6班	|\n\
|	15	|	谢言	|	-	|	初二6班	|\n\
|	16	|	刘禹凡	|	-	|	初二11班	|\n\
|	17	|	葛绍宁	|	-	|	初二3班	|\n\
|	18	|	陈德斌	|	-	|	初二4班	|\n\
|	19	|	许梓航	|	-	|	初二2班	|\n\
|	20	|	陈源	|	-	|	初二4班	|\n\
|	21	|	许中寅	|	-	|	初二1班	|\n\
|	22	|	姚月凯	|	-	|	初二8班	|\n\
|	23	|	王新睿	|	-	|	初二12班	|\n\
|	24	|	官睿晨	|	-	|	初二8班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';