var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高二年段</span>\n\
    <span class="txtb">男子组  三级跳远  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	#	|	姓名	|	数据	|	备注	|\n\
|	-	|	-	|	-	|	-	|\n\
|	1	|	陈子利	|	-	|	高二3班	|\n\
|	2	|	陈杰	|	-	|	高二9班	|\n\
|	3	|	林健波	|	-	|	高二7班	|\n\
|	4	|	陈冠华	|	-	|	高二6班	|\n\
|	5	|	陈铭绅	|	-	|	高二16班	|\n\
|	6	|	唐敬轩	|	-	|	高二7班	|\n\
|	7	|	肖学勋	|	-	|	高二11班	|\n\
|	8	|	蔡晏泽	|	-	|	高二4班	|\n\
|	9	|	严承天	|	-	|	高二13班	|\n\
|	10	|	钟毅铭	|	-	|	高二4班	|\n\
|	11	|	高子翔	|	-	|	高二8班	|\n\
|	12	|	陈鑫城	|	-	|	高二4班	|\n\
|	13	|	庄原	|	-	|	高二10班	|\n\
|	14	|	杨俊哲	|	-	|	高二3班	|\n\
|	15	|	胡致昊	|	-	|	高二6班	|\n\
|	16	|	周佳锜	|	-	|	高二16班	|\n\
|	17	|	林明瑞	|	-	|	高二6班	|\n\
|	18	|	卢宇腾	|	-	|	高二12班	|\n\
|	19	|	林俊鑫	|	-	|	高二11班	|\n\
|	20	|	林嘉祺	|	-	|	高二16班	|\n\
|	21	|	叶旭	|	-	|	高二10班	|\n\
|	22	|	陈远镒	|	-	|	高二1班	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';