var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初一年段</span>\n\
    <span class="txtb">男子组  100M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | 陈宋涛 | - | 初一8班 |\n\
| 2 | 张珂源 | - | 初一12班 |\n\
| 3 | 徐子木 | - | 初一5班 |\n\
| 4 | 张鑫炜 | - | 初一10班 |\n\
| 5 | 张恩涤 | - | 初一7班 |\n\
| 6 | 陈蔚 | - | 初一11班 |\n\
| 7 | 彭欣乐 | - | 初一12班 |\n\
| 8 | 林达熠 | - | 初一3班 |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | 陈予晨 | - | 初一6班 |\n\
| 2 | 郭雨洋 | - | 初一1班 |\n\
| 3 | 王睿杰 | - | 初一14班 |\n\
| 4 | 吴禹宸 | - | 初一5班 |\n\
| 5 | 李韪龙 | - | 初一4班 |\n\
| 6 | 林昀昊 | - | 初一13班 |\n\
| 7 | 王淳烨 | - | 初一11班 |\n\
| 8 | - | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | 林展熠 | - | 初一12班 |\n\
| 2 | 黄甫林 | - | 初一8班 |\n\
| 3 | 卓思承 | - | 初一11班 |\n\
| 4 | 洪浩添 | - | 初一10班 |\n\
| 5 | 郑谢伟 | - | 初一5班 |\n\
| 6 | 王弘熠 | - | 初一7班 |\n\
| 7 | 黄宇浩 | - | 初一3班 |\n\
| 8 | - | - | - |\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';