var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初一年段</span>\n\
    <span class="txtb">女子组  100M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | 林乐瑶 | - | 初一12班 |\n\
| 2 | 郑欣妍 | - | 初一4班 |\n\
| 3 | 陈思琪 | - | 初一9班 |\n\
| 4 | 梁熙汶 | - | 初一5班 |\n\
| 5 | 陈予湉 | - | 初一13班 |\n\
| 6 | 李思玥 | - | 初一14班 |\n\
| 7 | 刘睿旗 | - | 初一8班 |\n\
| 8 | | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | 余思泓 | - | 初一11班 |\n\
| 2 | 王金菁 | - | 初一2班 |\n\
| 3 | 郑铃珊 | - | 初一7班 |\n\
| 4 | 陈菲雨 | - | 初一13班 |\n\
| 5 | 陈玥忻 | - | 初一5班 |\n\
| 6 | 林妙禧 | - | 初一3班 |\n\
| 7 | 柯泳佳 | - | 初一14班 |\n\
| 8 | | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | 罗友欢 | - | 初一10班 |\n\
| 2 | 郭耀婷 | - | 初一11班 |\n\
| 3 | 吴念芊 | - | 初一2班 |\n\
| 4 | 郑灵怡 | - | 初一9班 |\n\
| 5 | 鲍芷昕 | - | 初一13班 |\n\
| 6 | 郑雅彤 | - | 初一5班 |\n\
| 7 | 陈颖萱 | - | 初一6班 |\n\
| 8 | | - | - |\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';