var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初二年段</span>\n\
    <span class="txtb">男子组  100M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | 陈泽楷 | - | 初二8班 |\n\
| 2 | 侯宗好 | - | 初二12班 |\n\
| 3 | 余熙童 | - | 初二5班 |\n\
| 4 | 陈基州 | - | 初二3班 |\n\
| 5 | 王柯楠 | - | 初二2班 |\n\
| 6 | 林宗翰 | - | 初二11班 |\n\
| 7 | 丁璨霖 | - | 初二1班 |\n\
| 8 | | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | | - | - |\n\
| 2 | 翁晨阳 | - | 初二7班 |\n\
| 3 | 吴鸣泓 | - | 初二12班 |\n\
| 4 | 林嘉逸 | - | 初二6班 |\n\
| 5 | 张峻赫 | - | 初二3班 |\n\
| 6 | 陈彦康 | - | 初二4班 |\n\
| 7 | 刘亦翔 | - | 初二11班 |\n\
| 8 | | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | | - | - |\n\
| 2 | 高继瀚 | - | 初二5班 |\n\
| 3 | 陈茂荣 | - | 初二7班 |\n\
| 4 | 叶嘉乐 | - | 初二9班 |\n\
| 5 | 谢言 | - | 初二6班 |\n\
| 6 | 杨文逍 | - | 初二10班 |\n\
| 7 | 张羽铮 | - | 初二4班 |\n\
| 8 | | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | | - | - |\n\
| 2 | 王喆赫 | - | 初二12班 |\n\
| 3 | 林元瀚 | - | 初二5班 |\n\
| 4 | 江尚坤 | - | 初二2班 |\n\
| 5 | 黄天健 | - | 初二8班 |\n\
| 6 | 林泽尧 | - | 初二6班 |\n\
| 7 | 朱杰 | - | 初二10班 |\n\
| 8 | | - | - |\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';