var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">初三年段</span>\n\
    <span class="txtb">男子组  100M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | 林礼贤 | - | 初三2班 |\n\
| 2 | 叶文杰 | - | 初三3班 |\n\
| 3 | 张行健 | - | 初三4班 |\n\
| 4 | 李泽宇 | - | 初三12班 |\n\
| 5 | 黄羿灿 | - | 初三9班 |\n\
| 6 | 郑宇辰 | - | 初三11班 |\n\
| 7 | 林锦泓 | - | 初三1班 |\n\
| 8 | | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | 刘凯烨 | - | 初三1班 |\n\
| 2 | 陈凯 | - | 初三7班 |\n\
| 3 | 林宸君 | - | 初三12班 |\n\
| 4 | 邹铸星 | - | 初三6班 |\n\
| 5 | 周晟榛 | - | 初三3班 |\n\
| 6 | 雷博涛 | - | 初三4班 |\n\
| 7 | 李学睿 | - | 初三11班 |\n\
| 8 | | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | 陈瀚洋 | - | 初三3班 |\n\
| 2 | 林后融 | - | 初三1班 |\n\
| 3 | 游浩瀚 | - | 初三8班 |\n\
| 4 | 郑志彬 | - | 初三10班 |\n\
| 5 | 陈明森 | - | 初三5班 |\n\
| 6 | 王宇鹏 | - | 初三6班 |\n\
| 7 | 方宇辰 | - | 初三12班 |\n\
| 8 | | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 备注 |\n\
| - | - | - | - |\n\
| 1 | | - | - |\n\
| 2 | 林锐成 | - | 初三3班 |\n\
| 3 | 翁才硕 | - | 初三4班 |\n\
| 4 | 陈铭皓 | - | 初三8班 |\n\
| 5 | 刘科江 | - | 初三7班 |\n\
| 6 | 林书禾 | - | 初三11班 |\n\
| 7 | 卓林浩 | - | 初三2班 |\n\
| 8 | | - | - |\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';