var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高一年段</span>\n\
    <span class="txtb">男子组  200M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 排名 | 班级 |\n\
| - | - | - | - | - |\n\
| 1 | 张逸晨 | - | - | 高一12班 |\n\
| 2 | 林子翔 | - | - | 高一10班 |\n\
| 3 | 谢颂平 | - | - | 高一13班 |\n\
| 4 | 王玉东 | - | - | 高一15班 |\n\
| 5 | 潘忱俨 | - | - | 高一8班 |\n\
| 6 | 朱奕军 | - | - | 高一9班 |\n\
| 7 | 林子辰 | - | - | 高一5班 |\n\
| 8 | | - | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 排名 | 班级 |\n\
| - | - | - | - | - |\n\
| 1 | 蒋泊元 | 26.70 | 8 | 高一5班 |\n\
| 2 | 王奕钱 | - | - | 高一12班 |\n\
| 3 | 金峰毅 | - | - | 高一10班 |\n\
| 4 | 杨宸烨 | - | - | 高一2班 |\n\
| 5 | 张子渊 | - | - | 高一15班 |\n\
| 6 | 赖永垚 | - | - | 高一6班 |\n\
| 7 | 吴烨豪 | - | - | 高一9班 |\n\
| 8 |  | - | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 排名 | 班级 |\n\
| - | - | - | - | - |\n\
| 1 | 黄润峰 | 26.09 | 6 | 高一14班 |\n\
| 2 | 陈子豪 | - | - | 高一7班 |\n\
| 3 | 兰梓恒 | - | - | 高一12班 |\n\
| 4 | 林其楷 | - | - | 高一10班 |\n\
| 5 | 钱禹泽 | 25.91 | 5 | 高一11班 |\n\
| 6 | 周胤霖 | 25.00 | 1 | 高一1班 |\n\
| 7 | 倪炙轩 | 25.67 | 3 | 高一6班 |\n\
| 8 | | - | - | - |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 排名 | 班级 |\n\
| - | - | - | - | - |\n\
| 1 | | - | - | - |\n\
| 2 | 邹志涛 | - | - | 高一3班 |\n\
| 3 | 陈诺霖 | 25.85 | 4 | 高一7班 |\n\
| 4 | 陈子睿 | 25.43 | 2 | 高一4班 |\n\
| 5 | 张熙 | - | - | 高一9班 |\n\
| 6 | 方宇辰 | - | - | 高一11班 |\n\
| 7 | 黄宏彬 | 26.40 | 7 | 高一1班 |\n\
| 8 | | - | - | - |\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';