var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高二年段</span>\n\
    <span class="txtb">男子组  200M  预赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 排名 | 班级 |\n\
| - | - | - | - | - |\n\
| 1 | 黄宇轩 | - | - | 高二5班 |\n\
| 2 | 周佳锜 | - | - | 高二16班 |\n\
| 3 | 江杰康 | - | - | 高二11班 |\n\
| 4 | 丁跃翔 | 24.62 | 1 | 高二3班 |\n\
| 5 | 陈则钜 | - | - | 高二15班 |\n\
| 6 | 黄显宸 | - | - | 高二16班 |\n\
| 7 | 王垚彬 | 24.79 | 2 | 高二7班 |\n\
| 8 | 陈礼楷 | - | - | 高二8班 |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 排名 | 班级 |\n\
| - | - | - | - | - |\n\
| 1 | 陈俊懋 | 24.83 | 3 | 高二8班 |\n\
| 2 | 林哲昊 | - | - | 高二5班 |\n\
| 3 | 王楚彬 | - | - | 高二1班 |\n\
| 4 | 林延鑫 | 27.23 | 7 | 高二11班 |\n\
| 5 | 张海韵 | 25.36 | 4 | 高二12班 |\n\
| 6 | 魏廷 | - | - | 高二6班 |\n\
| 7 | 林嘉祺 | - | - | 高二16班 |\n\
| 8 | 江楚凡 | - | - | 高二10班 |\n\
\n\
&nbsp;\n\
\n\
| 赛道 | 姓名 | 数据 | 排名 | 班级 |\n\
| - | - | - | - | - |\n\
| 1 | 庄原 | - | - | 高二10班 |\n\
| 2 | 朱李行正 | - | - | 高二13班 |\n\
| 3 | 周嘉毅 | 26.31 | 5 | 高二5班 |\n\
| 4 | 孙为权 | 27.61 | 8 | 高二15班 |\n\
| 5 | 黄家铭 | 26.60 | 6 | 高二11班 |\n\
| 6 | 陈冠泽 | - | - | 高二9班 |\n\
| 7 | 廖铭轩 | - | - | 高二3班 |\n\
| 8 | - | - | - | - |\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';