var m = document.querySelectorAll('code[markdown]');

var namelist = '\
<div id="_title">\n\
    <span class="txta">高三年段</span>\n\
    <span class="txtb">女子组  4X100M接力  决赛</span>\n\
    <a href="../menu.html"><button class="home">首页</button></a>\n\
</div>\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	班级	|	数据	| 排名 | 分数 |	备注	|\n\
|	-	|	-	|	- | - | -	|	-	|\n\
|	1	|	高三15班	|	-	|	- | - | -	|\n\
|	2	|	高三13班	|	1:06.19	|	3 | 8 | -	|\n\
|	3	|	高三5班	|	-	|	- | - | -	|\n\
|	4	|	高三10班	|	-	|	- | - | -	|\n\
|	5	|	高三3班	|	-	|	- | - | -	|\n\
|	6	|	高三1班	|	-	|	- | - | -	|\n\
|	7	|	高三11班	|	-	|	- | - | -	|\n\
|	8	|	高三14班	|	-	|	- | - | -	|\n\
\n\
&nbsp;\n\
\n\
|	赛道	|	班级	|	数据	| 排名 | 分数 |	备注	|\n\
|	-	|	-	|	- | - | -	|	-	|\n\
|	1	|	高三8班	|	1:07.67	|	5 | 4 | -	|\n\
|	2	|	高三2班	|	1:03.95	|	1 | 14 | -	|\n\
|	3	|	高三9班	|	-	|	- | - | -	|\n\
|	4	|	高三6班	|	1:07.68	|	6 | 2 | -	|\n\
|	5	|	高三4班	|	1:05.54	|	2 | 10 | -	|\n\
|	6	|	高三12班	|	1:07.32	|	4 | 6 | -	|\n\
|	7	|	高三7班	|	-	|	- | - | -	|\n\
|	8	|	-	|	- | - | -	|	-	|\n\
';

m[0].innerHTML = namelist;
m[0].outerHTML = '<div>' + marked(m[0].innerHTML) + '</div>';